### 用户管理：

注册用户：普通用户和管理员通过账号名称和密码注册，并创建昵称

登录用户：普通用户通过账号名称和密码登录



登出用户：用户退出登录



修改昵称：普通用户和管理员修改自己的个人昵称



禁言用户：管理员禁言某个用户，使其无法发布帖子和评论

### 帖子管理：





创建帖子：普通用户发布新帖子，包含标题、内容和一个Tag（分类）



删除帖子：管理员删除某个帖子



修改帖子内容：普通用户修改自己帖子的具体内容（标题和Tag不可修改）



置顶帖子：管理员置顶某个帖子



取消置顶帖子：管理员取消某个置顶帖的置顶状态



点赞帖子：用户对某个帖子进行点赞



取消点赞帖子：用户对之前点赞的帖子取消点赞



查询帖子详情：普通用户或管理员查看某个帖子的具体内容，包括标题、内容、Tag、点赞数、评论等



查询帖子列表：普通用户或管理员按Tag分类及最新评论时间排序查看帖子列表



查询置顶帖子：管理员查询当前所有置顶的帖子

### 评论管理：





添加评论：用户对某个帖子添加评论



删除评论：管理员删除某条评论



添加回应：用户对某条评论进行回复



点赞评论：用户对某条评论进行点赞



取消点赞评论：用户对之前点赞的评论取消点赞



查询评论详情：查看某条评论具体内容，包括点赞数及其下的所有回复

### 首页管理：





查询首页列表：获取首页展示的帖子标题、Tag和评论数，按最新评论时间排序



查询置顶帖列表：获取首页展示的置顶帖子标题、Tag和评论数，置顶帖按最新评论时间排序
